# Introduction to Tcl

```Tcl

# initialize a variable
> set a 99
99

# print a string or variable value
> puts "Hello World!"
Hello World

> puts $a
99

# evaluate expressions
> expr 2 + 2
4

```
